---
kind: property
id: P:Autodesk.Revit.DB.LeaderArray.Item(System.Int32)
source: html/994f89e8-cdde-c767-d5d1-4d295f862d65.htm
---
# Autodesk.Revit.DB.LeaderArray.Item Property

Gets or sets an item at a specified index within the array.

## Syntax (C#)
```csharp
public virtual Leader this[
	int index
] { get; set; }
```

## Parameters
- **index** (`System.Int32`) - The index of the item to be set or retrieved.

## Returns
Returns the object at the specified index.